{
  "name": "Aboleth",
  "size": "Large",
  "type": "Aberration",
  "alignment": "Lawful Evil",
  "armor_class": 17,
  "hit_points": {
    "average": 150,
    "dice": "20d10 + 40"
  },
  "speed": {
    "walk": { "value": 10, "unit": "ft." },
    "swim": { "value": 40, "unit": "ft." }
  },
  "initiative": {
    "modifier": 7,
    "score": 17
  },
  "ability_scores": {
    "strength": { "score": 21, "modifier": 5, "save": 5 },
    "dexterity": { "score": 9, "modifier": -1, "save": 3 },
    "constitution": { "score": 15, "modifier": 2, "save": 6 },
    "intelligence": { "score": 18, "modifier": 4, "save": 8 },
    "wisdom": { "score": 15, "modifier": 2, "save": 6 },
    "charisma": { "score": 18, "modifier": 4, "save": 4 }
  },
  "skills": [
    { "name": "History", "modifier": 12 },
    { "name": "Perception", "modifier": 10 }
  ],
  "senses": {
    "darkvision": { "value": 120, "unit": "ft." },
    "passive_perception": 20
  },
  "languages": ["Deep Speech"],
  "telepathy": { "value": 120, "unit": "ft." },
  "challenge_rating": {
    "rating": "10",
    "xp": 5900,
    "lair_xp": 7200
  },
  "proficiency_bonus": 4,
  "traits": [
    {
      "name": "Amphibious",
      "description": "The aboleth can breathe air and water."
    },
    {
      "name": "Eldritch Restoration",
      "description": "If destroyed, the aboleth gains a new body in 5d10 days, reviving with all its Hit Points in the Far Realm or another location chosen by the GM."
    },
    {
      "name": "Legendary Resistance",
      "description": "If the aboleth fails a saving throw, it can choose to succeed instead.",
      "usage": { "type": "per_day", "times": 3, "lair_times": 4 }
    },
    {
      "name": "Mucus Cloud",
      "description": "While underwater, the aboleth is surrounded by mucus. Constitution Saving Throw: DC 14, each creature in a 5-foot Emanation originating from the aboleth at the end of the aboleth’s turn. Failure: The target is cursed. Until the curse ends, the target’s skin becomes slimy, the target can breathe air and water, and it can’t regain Hit Points unless it is underwater. While the cursed creature is outside a body of water, the creature takes 6 (1d12) Acid damage at the end of every 10 minutes unless moisture is applied to its skin before those minutes have passed."
    },
    {
      "name": "Probing Telepathy",
      "description": "If a creature the aboleth can see communicates telepathically with the aboleth, the aboleth learns the creature’s greatest desires."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The aboleth makes two Tentacle attacks and uses either Consume Memories or Dominate Mind if available."
    },
    {
      "name": "Tentacle",
      "description": "Melee Attack Roll: +9, reach 15 ft. Hit: 12 (2d6 + 5) Bludgeoning damage. If the target is a Large or smaller creature, it has the Grappled condition (escape DC 14) from one of four tentacles."
    },
    {
      "name": "Consume Memories",
      "description": "Intelligence Saving Throw: DC 16, one creature within 30 feet that is Charmed or Grappled by the aboleth. Failure: 10 (3d6) Psychic damage. Success: Half damage. Failure or Success: The aboleth gains the target’s memories if the target is a Humanoid and is reduced to 0 Hit Points by this action."
    },
    {
      "name": "Dominate Mind",
      "description": "Wisdom Saving Throw: DC 16, one creature the aboleth can see within 30 feet. Failure: The target has the Charmed condition until the aboleth dies or is on a different plane of existence from the target. While Charmed, the target acts as an ally to the aboleth and is under its control while within 60 feet of it. In addition, the aboleth and the target can communicate telepathically with each other over any distance. The target repeats the save whenever it takes damage as well as after every 24 hours it spends at least 1 mile away from the aboleth, ending the effect on itself on a success.",
      "usage": { "type": "per_day", "times": 2 }
    }
  ],
  "legendary_actions": {
    "uses": 3,
    "lair_uses": 4,
    "description": "Immediately after another creature’s turn, the aboleth can expend a use to take one of the following actions. The aboleth regains all expended uses at the start of each of its turns.",
    "actions": [
      {
        "name": "Lash",
        "description": "The aboleth makes one Tentacle attack."
      },
      {
        "name": "Psychic Drain",
        "description": "If the aboleth has at least one creature Charmed or Grappled, it uses Consume Memories and regains 5 (1d10) Hit Points."
      }
    ]
  }
}