{
  "name": "Night Hag",
  "size": "Medium",
  "type": "Fiend",
  "alignment": "Neutral Evil",
  "armor_class": 17,
  "hit_points": {
    "average": 112,
    "dice": "15d8 + 45"
  },
  "speed": {
    "walk": { "value": 30, "unit": "ft." }
  },
  "initiative": {
    "modifier": 5,
    "score": 15
  },
  "ability_scores": {
    "strength": { "score": 18, "modifier": 4, "save": 4 },
    "dexterity": { "score": 15, "modifier": 2, "save": 2 },
    "constitution": { "score": 16, "modifier": 3, "save": 3 },
    "intelligence": { "score": 16, "modifier": 3, "save": 3 },
    "wisdom": { "score": 14, "modifier": 2, "save": 2 },
    "charisma": { "score": 16, "modifier": 3, "save": 3 }
  },
  "skills": [
    { "name": "Deception", "modifier": 6 },
    { "name": "Insight", "modifier": 5 },
    { "name": "Perception", "modifier": 5 },
    { "name": "Stealth", "modifier": 5 }
  ],
  "resistances": ["Cold", "Fire"],
  "immunities": {
    "condition": ["Charmed"]
  },
  "senses": {
    "darkvision": { "value": 120, "unit": "ft." },
    "passive_perception": 15
  },
  "languages": ["Abyssal", "Common", "Infernal", "Primordial"],
  "challenge_rating": {
    "rating": "5",
    "xp": 1800
  },
  "proficiency_bonus": 3,
  "traits": [
    {
      "name": "Coven Magic",
      "description": "While within 30 feet of at least two hag allies, the hag can cast one of the following spells, requiring no Material components, using the spell’s normal casting time, and using Intelligence as the spellcasting ability (spell save DC 14): Augury, Find Familiar, Identify, Locate Object, Scrying, or Unseen Servant. The hag must finish a Long Rest before using this trait to cast that spell again."
    },
    {
      "name": "Magic Resistance",
      "description": "The hag has Advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Soul Bag",
      "description": "The hag has a soul bag. While holding or carrying the bag, the hag can use its Nightmare Haunting action. The bag has AC 15, HP 20, and Resistance to all damage. The bag turns to dust if reduced to 0 Hit Points. If the bag is destroyed, any souls the bag is holding are released. The hag can create a new bag after 7 days."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The hag makes two Claw attacks."
    },
    {
      "name": "Claw",
      "description": "Melee Attack Roll: +7, reach 5 ft. Hit: 13 (2d8 + 4) Slashing damage."
    },
    {
      "name": "Nightmare Haunting",
      "description": "While on the Ethereal Plane, the hag casts Dream, using the same spellcasting ability as Spellcasting. Only the hag can serve as the spell’s messenger, and the target must be a creature the hag can see on the Material Plane. The spell fails and is wasted if the target is under the effect of the Protection from Evil and Good spell or within a Magic Circle spell. If the target takes damage from the Dream spell, the target’s Hit Point maximum decreases by an amount equal to that damage. If the spell kills the target, its soul is trapped in the hag’s soul bag, and the target can’t be raised from the dead until its soul is released.",
      "usage": { "type": "per_day", "times": 1, "prerequisite": "Soul Bag" }
    },
    {
      "name": "Spellcasting",
      "description": "The hag casts one of the following spells, requiring no Material components and using Intelligence as the spellcasting ability (spell save DC 14):\nAt Will: Detect Magic, Etherealness, Magic Missile (level 4 version)\n2/Day Each: Phantasmal Killer, Plane Shift (self only)"
    }
  ],
  "bonus_actions": [
    {
      "name": "Shape-Shift",
      "description": "The hag shape-shifts into a Small or Medium Humanoid, or it returns to its true form. Other than its size, its game statistics are the same in each form. Any equipment it is wearing or carrying isn’t transformed."
    }
  ]
}