{
  "name": "Kraken",
  "size": "Gargantuan",
  "type": "Monstrosity (Titan)",
  "alignment": "Chaotic Evil",
  "armor_class": 18,
  "hit_points": {
    "average": 481,
    "dice": "26d20 + 208"
  },
  "speed": {
    "walk": { "value": 30, "unit": "ft." },
    "swim": { "value": 120, "unit": "ft." }
  },
  "initiative": {
    "modifier": 14,
    "score": 24
  },
  "ability_scores": {
    "strength": { "score": 30, "modifier": 10, "save": 17 },
    "dexterity": { "score": 11, "modifier": 0, "save": 7 },
    "constitution": { "score": 26, "modifier": 8, "save": 15 },
    "intelligence": { "score": 22, "modifier": 6, "save": 6 },
    "wisdom": { "score": 18, "modifier": 4, "save": 11 },
    "charisma": { "score": 20, "modifier": 5, "save": 5 }
  },
  "skills": [
    { "name": "History", "modifier": 13 },
    { "name": "Perception", "modifier": 11 }
  ],
  "immunities": {
    "damage": ["Cold", "Lightning"],
    "condition": ["Frightened", "Grappled", "Paralyzed", "Restrained"]
  },
  "senses": {
    "truesight": { "value": 120, "unit": "ft." },
    "passive_perception": 21
  },
  "languages": ["understands Abyssal, Celestial, Infernal, and Primordial but can’t speak"],
  "telepathy": { "value": 120, "unit": "ft." },
  "challenge_rating": {
    "rating": "23",
    "xp": 50000,
    "lair_xp": 62000
  },
  "proficiency_bonus": 7,
  "traits": [
    {
      "name": "Amphibious",
      "description": "The kraken can breathe air and water."
    },
    {
      "name": "Legendary Resistance",
      "description": "If the kraken fails a saving throw, it can choose to succeed instead.",
      "usage": { "type": "per_day", "times": 4, "lair_times": 5 }
    },
    {
      "name": "Siege Monster",
      "description": "The kraken deals double damage to objects and structures."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The kraken makes two Tentacle attacks and uses Fling, Lightning Strike, or Swallow."
    },
    {
      "name": "Tentacle",
      "description": "Melee Attack Roll: +17, reach 30 ft. Hit: 24 (4d6 + 10) Bludgeoning damage. The target has the Grappled condition (escape DC 20) from one of ten tentacles, and it has the Restrained condition until the grapple ends."
    },
    {
      "name": "Fling",
      "description": "The kraken throws a Large or smaller creature Grappled by it to a space it can see within 60 feet of itself that isn’t in the air. Dexterity Saving Throw: DC 25, the creature thrown and each creature in the destination space. Failure: 18 (4d8) Bludgeoning damage, and the target has the Prone condition. Success: Half damage only."
    },
    {
      "name": "Lightning Strike",
      "description": "Dexterity Saving Throw: DC 23, one creature the kraken can see within 120 feet. Failure: 33 (6d10) Lightning damage. Success: Half damage."
    },
    {
      "name": "Swallow",
      "description": "Dexterity Saving Throw: DC 25, one creature Grappled by the kraken (it can have up to four creatures swallowed at a time). Failure: 23 (3d8 + 10) Piercing damage. If the target is Large or smaller, it is swallowed and no longer Grappled. A swallowed creature has the Restrained condition, has Total Cover against attacks and other effects outside the kraken, and takes 24 (7d6) Acid damage at the start of each of its turns. If the kraken takes 50 damage or more on a single turn from a creature inside it, the kraken must succeed on a DC 25 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, each of which falls in a space within 10 feet of the kraken with the Prone condition. If the kraken dies, any swallowed creature no longer has the Restrained condition and can escape from the corpse using 15 feet of movement, exiting Prone."
    }
  ],
  "legendary_actions": {
    "uses": 3,
    "lair_uses": 4,
    "description": "Immediately after another creature’s turn, the kraken can expend a use to take one of the following actions. The kraken regains all expended uses at the start of each of its turns.",
    "actions": [
      {
        "name": "Storm Bolt",
        "description": "The kraken uses Lightning Strike."
      },
      {
        "name": "Toxic Ink",
        "description": "Constitution Saving Throw: DC 23, each creature in a 15-foot Emanation originating from the kraken while it is underwater. Failure: The target has the Blinded and Poisoned conditions until the end of the kraken’s next turn. The kraken then moves up to its Speed. Failure or Success: The kraken can’t take this action again until the start of its next turn."
      },
      {
        "name": "Tail Swipe",
        "description": "The kraken makes one Tentacle attack."
      }
    ]
  }
}